tutorials/immersedBoundary/pitzDailyTurbulent/0_org/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    pitzDailyIB
    {
        type            immersedBoundaryEpsilonWallFunction;
        patchType       immersedBoundary;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        setDeadValue    true;
        deadValue       14.855;
        value           uniform 14.855;
    }
    top
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 14.855;
        value           uniform 14.855;
    }
    bottom
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
